console.log{'Отзыв по пункам ТЗ:\n

Не выполненные/не засчитанные пункты:\n

1) плавная прокрутка по якорям\n

2) ссылки в футере ведут на гитхаб автора проекта и на страницу курса https://rs.school/js-stage0/\n

3) интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета \n

4) обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы\n

Все оставшиеся пункты выполнены\n'
}
